Table of Contents
 Enum ConnectorGridType
Namespace
IdeaRS.OpenModel.Parameters
Assembly
IdeaRS.OpenModel.dll
Defines a type of fasteners grid.
public enum ConnectorGridType
Fields
FirstShifted = 5
First shifted.
FirstShiftedFull = 1
First row is shifted.
FirstShiftedShort = 4
First row is shifted, second row is short.
Full = 3
Rows are full.
Regular = 0
Regular type of grid.
SecondShifted = 10
Second shifted.
SecondShiftedFull = 2
Second row is shifted
SecondShiftedShort = 8
Second row is shifted, first is short.
Short = 12
Rows are short.
Fields
 Name |  Description
 FirstShifted = 5
First shifted.
 FirstShiftedFull = 1
First row is shifted.
 FirstShiftedShort = 4
First row is shifted, second row is short.
 Full = 3
Rows are full.
 Regular = 0
Regular type of grid.
 SecondShifted = 10
Second shifted.
 SecondShiftedFull = 2
Second row is shifted
 SecondShiftedShort = 8
Second row is shifted, first is short.
 Short = 12
Rows are short.
 Edit this page